###############################################################################
# Created by write_sdc
###############################################################################
current_design adder16
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 4.8000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[0]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[10]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[11]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[12]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[13]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[14]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[15]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[1]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[2]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[3]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[4]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[5]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[6]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[7]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[8]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {a[9]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[0]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[10]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[11]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[12]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[13]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[14]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[15]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[1]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[2]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[3]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[4]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[5]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[6]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[7]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[8]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {b[9]}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {en}]
set_input_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {carry}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[0]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[10]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[11]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[12]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[13]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[14]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[15]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[1]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[2]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[3]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[4]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[5]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[6]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[7]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[8]}]
set_output_delay 0.9600 -clock [get_clocks {clk}] -add_delay [get_ports {sum[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {carry}]
set_load -pin_load 0.0334 [get_ports {sum[15]}]
set_load -pin_load 0.0334 [get_ports {sum[14]}]
set_load -pin_load 0.0334 [get_ports {sum[13]}]
set_load -pin_load 0.0334 [get_ports {sum[12]}]
set_load -pin_load 0.0334 [get_ports {sum[11]}]
set_load -pin_load 0.0334 [get_ports {sum[10]}]
set_load -pin_load 0.0334 [get_ports {sum[9]}]
set_load -pin_load 0.0334 [get_ports {sum[8]}]
set_load -pin_load 0.0334 [get_ports {sum[7]}]
set_load -pin_load 0.0334 [get_ports {sum[6]}]
set_load -pin_load 0.0334 [get_ports {sum[5]}]
set_load -pin_load 0.0334 [get_ports {sum[4]}]
set_load -pin_load 0.0334 [get_ports {sum[3]}]
set_load -pin_load 0.0334 [get_ports {sum[2]}]
set_load -pin_load 0.0334 [get_ports {sum[1]}]
set_load -pin_load 0.0334 [get_ports {sum[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {en}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
